Repository: hagereselam25-wq/qine_entertainment
Catalog: locale/ti/LC_MESSAGES/django.po
Languages: ti

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ti: እዚ መልእኽቲ እንተረኣዩ ምኽንያቱ እዚ ሳይት CSRF cookie ንምእታው ፎርም ይደሊ። እዚ cookie ብጥንታነ ምኽንያታት ይደሊ፣ እቲ browser እንተዘይተሰርቐ ብካልኦት ወጻኢ ይኸውን እዩ።

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
ti: እቲ browser እንተኣዘጋጀኩም ናይ cookie ንምብራርክ፣ በጃኹም እንደገና ኣብዚ ሳይት ኣብ least ወይ ን “same-origin” ሓሳባት ኣብርኽዎም።

source: More information is available with DEBUG=True.
ti: ተወሳኺ መረዳእታ ከምዝኾነ DEBUG=True ይኾን ይርከብ።

source: No year specified
ti: ዓመት ዘይተወሰነ

source: Date out of range
ti: መዓልቲ ካብ ዝተፈቀደ መደብ ኣውጺኡ

source: No month specified
ti: ኣይተገለጸ ወርሒ የለን

source: No day specified
ti: ኣይተገለጸ መዓልቲ የለን

source: No week specified
ti: ኣይተገለጸ ሰሙን የለን

source: No %(verbose_name_plural)s available
ti: %(verbose_name_plural)s የለን

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
ti: ናብ መጻኢ %(verbose_name_plural)s ኣይኮነን፣ ምኽንያቱ %(class_name)s.allow_future እዩ ዝተኣማለደ።

source: Invalid date string “%(datestr)s” given format “%(format)s”
ti: ኣይተፈቀደን መዓልቲ “%(datestr)s” ተሰጊሩ ቅርጺ “%(format)s”

source: No %(verbose_name)s found matching the query
ti: %(verbose_name)s ተመሳሳሊ ኣብ ሓበሬታ ኣይተረኸበን

source: Page is not “last”, nor can it be converted to an int.
ti: ገጽ ኣይኮነን “መወዳእታ”፣ ካብዚ ወደ ቁጽሪ ኣይተቐየረን።

source: Invalid page (%(page_number)s): %(message)s
ti: ኣይተፈቀደን ገጽ (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
ti: ናይ ዝሓለፈ ዝባዕሉ ዝትረኽብ ኣይኮነን፣ ምኽንያቱ “%(class_name)s.allow_empty” እዩ ዝተኣማለደ።

source: Directory indexes are not allowed here.
ti: ዝተዘዋረ መፍለጊ ማህደር ኣብዚ ኣይፈቀደን።

source: “%(path)s” does not exist
ti: “%(path)s” የለን

source: Index of %(directory)s
ti: መፍለጊ ዝርዝር %(directory)s

source: The install worked successfully! Congratulations!
ti: ናይ ተግባር ምእካብ ብሓቂ ተሳኪዐ! እንኳዕ ሓጎሰኩም!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
ti: <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">ሓበሬታ ምልባስ</a> ንDjango %(version)s ተመልከቱ

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
ti: ነዚ ገጽ እዩ ተርኢካ ምኽንያቱ <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> ኣብ ቅንብል ፋይልኩም እዩ ዝርከብ እናስኮ URL ኣይተሰናዱን።

source: Django Documentation
ti: መሰናድ ሰነድ Django

source: Topics, references, &amp; how-to’s
ti: ነገራት፣ ምዝናን፣ ከመይ ይግበር

source: Tutorial: A Polling App
ti: መምርሒ፡ ናይ መዓቀኒ ሓበሬታ መተግበሪ

source: Get started with Django
ti: ብDjango ጀምሩ

source: Django Community
ti: ማሕበር Django

source: Connect, get help, or contribute
ti: ተዛረብ፣ ሓገዝ ወስድ፣ ወይ ኣተኣትው
