Repository: hagereselam25-wq/qine_entertainment
Catalog: locale/ti/LC_MESSAGES/django.po
Languages: ti

source: Title
ti: ርእስ

source: Description
ti: መግለጺ

source: Show Time
ti: ግዜ ንትርእስ

source: Poster
ti: ፖስተር

source: Trailer File
ti: ፋይል ትሬይለር

source: Trailer URL
ti: URL ትሬይለር

source: Number of Rows
ti: ቍጽሪ ረድዶታት

source: Seats per Row
ti: ቦታታት ኣብ ኣንድ ረድዶ

source: Rating
ti: ክፍሊት ኣምላኽ

source: Movie
ti: ፊልም

source: Seat Number
ti: ቦታ ቁጽሪ

source: Is Booked
ti: ተይኮሰን እዩ

source: User
ti: ተጠቃሚ

source: Email
ti: ኢሜል

source: Seat
ti: ቦታ

source: Reservation Time
ti: ግዜ ኣብ መደብ ተይኮሰን

source: QR Code
ti: QR ኮድ

source: Is Paid
ti: ተኽፈለ

source: Email Sent
ti: ኢሜል ተላኸ

source: Reservation
ti: ተይኮሰን

source: Transaction ID
ti: መለያ ግብዓት

source: Amount
ti: መጠን

source: Status
ti: ሁኽእታ

source: Created At
ti: ተፈጥሮ ብ

source: Cinema Ticket Reservation
ti: ትኬት ሲነማ መደብ ተይኮሰን

source: Home
ti: ዋና ገጽ

source: Streaming
ti: ቀጥታ ማይክሮን

source: Welcome, %(user.username)s
ti: እንቋዕ ብደሓን መጻእኩ, %(user.username)s

source: Profile
ti: መግለጺ ተጠቃሚ

source: Logout
ti: ውግድ

source: Login
ti: ግባ

source: Sign Up
ti: ይመዝግቡ

source: Search movies...
ti: ፊልም ይፈልጡ...

source: Search
ti: ፈልጊ

source: Book a Movie Ticket
ti: ፊልም ትኬት ይይኮሱ

source: Book Now
ti: ኣብዚ ይይኮሱ

source: Watch Online (Streaming)
ti: ቀጥታ ማይክሮን ተመልከት

source: Stream
ti: ቀጥታ ኣሳይ

source: Login to Stream
ti: ንቀጥታ ማይክሮን ግባ

source: Movies
ti: ፊልሞታት

source: Now Showing
ti: ኣብዚ ኣሳይተዋሽ

source: poster
ti: ፖስተር

source: Your browser does not support the video tag.
ti: ብሮውዘርካ ታግ ቪዲዮ ኣይደገፍን

source: Book Seats
ti: ቦታታት ይይኮሱ

source: Payment Failed
ti: ክፍሊት ኣይተሳነን

source: We couldn't verify your payment. Please try again or contact support.
ti: ክፍሊትካ ኣይተረጋገጸን። ብድጋፍ ድጋፍ ወይ ሓገዝ ኣብ ድጋፍ ንገብር

source: Back to Home
ti: ተመለስ ወደ ዋና ገጽ

source: Payment Successful!
ti: ክፍሊት ተሳነን!

source: Thank you, %(username)s. Your seat %(seat)s is confirmed.
ti: የቐንየለይ, %(username)s። ቦታካ %(seat)s ተረጋግጽና ኣሎ።

source: Your Ticket QR Code
ti: QR ኮድ ትኬትካ

source: Download QR Code
ti: QR ኮድ ይውሰድ

source: QR code is not available.
ti: QR ኮድ ኣይኾነን

source: Return to Home
ti: ተመለስ ወደ ዋና ገጽ

source: Seat Selection
ti: መረጸ ቦታ

source: Seat Selection for %(title)s
ti: መረጸ ቦታ ን %(title)s

source: Your Name:
ti: ስምካ:

source: Your Email:
ti: ኢሜልካ:

source: Select Seat:
ti: ቦታ ይምረጡ:

source: Seat %(seatnum)s
ti: ቦታ %(seatnum)s

source: Booked
ti: ተይኮሰን

source: Payment Amount (ETB):
ti: መጠን ክፍሊት (ETB):

source: Enter payment amount
ti: መጠን ኣስገባ

source: Confirm Reservation & Pay
ti: ተይኮሰን ያረጋግጡ ኣብዚ ክፍሊት ክፍሉ

source: Seat %(seatnum)s
ti: ቦታ %(seatnum)s

source: Sorry, this seat is already booked. Please select another available seat.
ti: ይቕሬታ, ዚ ቦታ ኣብዚ ተይኮሰን ኣሎ። ኣንደኛ ቦታ ይምረጡ።

source: Close
ti: ዝጋ

source: Thank You
ti: የቐንየለይ

source: Thank you for your reservation!
ti: ኣብ መደብ ተይኮሰካ የቐንየለይ!

source: Your reference:
ti: መጠን ምስልካ:

source: Name:
ti: ስም:

source: Movie:
ti: ፊልም:

source: Date:
ti: ቀን:

source: Seat:
ti: ቦታ:

source: QR Code Confirmation
ti: QR ኮድ ማረጋገጺ

source: Download Ticket QR
ti: QR ኮድ ትኬት ይውሰድ

source: Reservation Successful 🎉
ti: ተይኮሰን ተሳነን 🎉

source: Thank you for your payment. Here is your ticket:
ti: ኣብ ክፍሊትካ የቐንየለይ። እዚ ትኬትካ እዩ:

source: Ticket Confirmation
ti: ማረጋገጺ ትኬት

source: Your Booking is Confirmed!
ti: መደብ ተይኮሰካ ተረጋግጸኒ!

source: Email:
ti: ኢሜል:

source: Show Time:
ti: ግዜ ኣሳይ:

source: You don't have permission to view this video.
ti: ንዚ ቪዲዮ ምርኣይ ፈቃድ ኣየንኩን

source: Invalid amount
ti: መጠን ኣይተረጋገጸን

source: Please enter a valid payment amount.
ti: እባክካ መጠን ንክፍሊት ይኽእል ኣስገባ

source: Seat already booked.
ti: ቦታ ኣብዚ ተይኮሰን ኣሎ።

source: Cinema seat booking
ti: መደብ ቦታ ሲነማ

source: Payment initialization failed. Try again.
ti: መጀመር ክፍሊት ኣይተሳነን። ድጋፍ ድጋፍ ይሞክሩ

source: Invalid seat.
ti: ቦታ ኣይተረጋገጸን

source: Transaction reference missing.
ti: መጠን ምስል ዝብል ኣይኾነን።

source: Payment verification failed.
ti: ክፍሊት ምረጽ ኣይተሳነን።

source: Transaction not found.
ti: መጠን ኣይተረኽበን።

source: 🎟 Your Cinema Ticket Confirmation
ti: 🎟 ናይ ሲነማ ትኬትካ ማረጋገጺ

source: Ticket is not paid yet. Please complete payment to access.
ti: ትኬት ኣሎኻ ኣይተክፈለን። ንመድረስ ክፍሊት ይሙሉ

source: Missing tx_ref.
ti: tx_ref ዘይኾነ ኣሎ።

source: Invalid credentials or not authorized.
ti: መለለይ መረጃ ወይ ፈቃድ ኣይነበርን

source: Total Watch Time (min)
ti: ጠቅላላ ጊዜ ንመርበብ (ደቒቕታት)

source: Download CSV
ti: CSV ይውሰድ

source: Analytics CSV
ti: CSV ምርምር መረጃ

source: Views
ti: ትርጉምታት

source: Watch Time (min)
ti: ጊዜ ንመርበብ (ደቒቕታት)

source: Completion Rate
ti: ደመወዝ ኣስከተለን

source: Country
ti: ሃገር

source: Unknown
ti: ዘይተረዳ

source: No QR code
ti: QR ኮድ ኣይኮነን

source: Full Name
ti: ሙሉ ስም

source: Subscription Type
ti: ኣይነት ኣባልነት

source: Monthly
ti: ወርሓዊ

source: Annual
ti: ዓመታዊ

source: Subscription Plan
ti: ኣባልነት እትሕትና

source: Username
ti: ስም ተጠቃሚ

source: Password
ti: መንነት ቃል

source: Confirm Password
ti: መንነት ቃል ያረጋግጡ

source: Email address already in use.
ti: ኢሜል ኣሎ ተጠቃሚ ተጠቐምቲ ኣሎ።

source: Profile Picture
ti: ምስል ፕሮፋይል

source: Bio
ti: ሓበሬታ ሕይወት

source: Transaction Reference
ti: መጠን ምስል

source: First Name
ti: ስም መጀመሪ

source: Last Name
ti: ስም ኣካል መጨረሻ

source: Transaction
ti: መጠን

source: Chapa Transaction Reference
ti: Chapa መጠን ምስል

source: Paid
ti: ተክፈለ

source: Access Expires At
ti: ግዜ መድረስ ይፈጸምበታል

source: Series
ti: ስርኣት

source: Documentary
ti: ዶክመንታሪ

source: Short Film
ti: ኣጭር ፊልም

source: Other
ti: ካልእ

source: Category
ti: መደብ

source: Thumbnail
ti: ነጠላ ምስል

source: Upload Video
ti: ቪዲዮ ኣብልሉ

source: Upload video securely
ti: ቪዲዮ ብ ደሓንነት ኣብልሉ

source: Video URL
ti: Video ዩአርኤል

source: Optional external video URL
ti: ካልእ ዩአርኤል ቪዲዮ ዝሓለፈ ነው።

source: HLS Folder
ti: HLS ፎልደር

source: Path to generated HLS folder
ti: መንገዲ ናይ ፍሉጥ ነው ፎልደር HLS

source: Price per View
ti: ዋጋ ንእድል ንመርበብ

source: Duration (minutes)
ti: ግዜ (ደቒቕታት)

source: Total duration in minutes
ti: ጠቅላላ ግዜ ኣብ ደቒቕታት

source: Release Date
ti: ዕለት ማውጫ

source: Total Plays
ti: ጠቅላላ ገምጋምታት

source: Unique Viewers
ti: ብቕዕ ተመልከታኺ ሰብ

source: Total Watch Time (seconds)
ti: ጠቅላላ ጊዜ ንመርበብ (ሰከንድ)

source: Last Viewed
ti: መጨረሻ ተመልከተ

source: Watch Time (seconds)
ti: ጊዜ ንመርበብ (ሰከንድ)

source: Video Title
ti: ርእስ ቪዲዮ

source: Watch Date
ti: ዕለት መርበብ

source: Duration Watched (minutes)
ti: ዝተመረቀ ግዜ (ደቒቕታት)

source: Streaming Analytics
ti: ትንታነ ምርምር ንምርበብ

source: HLS conversion failed:
ti: ምስትርበብ HLS ኣይተሳነን፦

source: Total Views: %(total_views)s
ti: ጠቅላላ ትርጉምታት: %(total_views)s

source: Unique Viewers: %(total_unique_viewers)s
ti: ብቕዕ ተመልከታኺ ሰብ: %(total_unique_viewers)s

source: Total Watch Time: %(total_watch_time_minutes)s mins
ti: ጠቅላላ ጊዜ ንመርበብ: %(total_watch_time_minutes)s ደቒቕታት

source: Views by Country:
ti: ትርጉምታት ኣብ ሃገር:

source: No country data available.
ti: መረጃ ኣብ ሃገር ዘይተሰርሐ ኣሎ።

source: ⬇️ Download CSV
ti: ⬇️ CSV ይውሰድ

source: Content
ti: ይዕቀብ

source: Total Views
ti: ጠቅላላ ትርጉምታት

source: Total Watch Time (mins)
ti: ጠቅላላ ጊዜ ንመርበብ (ደቒቕታት)

source: Completion Rate (%%)
ti: ደመወዝ ኣስከተለን (%%)

source: No analytics available yet.
ti: ጥናት ኣሎኻ ዘይኮነን።

source: Subscribe to Streaming
ti: ኣባልነት ንመርበብ ይመዝገቡ

source: Proceed to Payment
ti: ክፍሊት ይቀጽሉ

source: Update Picture
ti: ምስል ዝዘምን

source: Stats
ti: ስታትስቲክስ

source: Total Videos Watched:
ti: ጠቅላላ ቪዲዮታት ዝተመረቁ:

source: Total Watch Time:
ti: ጠቅላላ ጊዜ ንመርበብ:

source: minutes
ti: ደቒቕታት

source: Watch History
ti: ታሪኽ መርበብ

source: Duration Watched
ti: ግዜ ዝተመረቀ

source: min
ti: ደቒቕታት

source: No watch history found.
ti: ታሪኽ መርበብ ኣይተረኽበን።

source: Streaming Content
ti: ይዕቀብ ንመርበብ

source: Category: %(content.get_category_display)s
ti: መደብ: %(content.get_category_display)s

source: Release Date: %(content.release_date)s
ti: ዕለት ማውጫ: %(content.release_date)s

source: Duration: %(content.duration_minutes)s minutes
ti: ግዜ: %(content.duration_minutes)s ደቒቕታት

source: Watch Now
ti: ኣሁን ይመርቡ

source: No video available
ti: ቪዲዮ ኣይኮነን

source: No streaming content available yet.
ti: ይዕቀብ ንመርበብ ኣሎኻ ዘይኮነን።

source: Thank You for Subscribing!
ti: ኣመሰግናለይ ንኣባልነት ምዝገብካ!

source: Type:
ti: ኣይነት:

source: Status:
ti: ሁኽታ:

source: Paid,Unpaid
ti: ተኸፈለ, ዘይተኸፈለ

source: Download Ticket
ti: ትኬት ይውሰዱ

source: Subscription not found.
ti: ኣባልነት ኣይተረኽበን።

source: User Login
ti: መኣዝያ ተጠቃሚ

source: Don't have an account?
ti: ሂሳብ ዘይኮነን?

source: Sign up
ti: ይመዝገቡ

source: Sign Up - Streaming Subscription
ti: ይመዝገቡ - ኣባልነት ንመርበብ

source: Sign Up for Streaming Subscription
ti: ንኣባልነት ንመርበብ ይመዝገቡ

source: Monthly - 500 ETB
ti: ኣብ ወርሒ - 500 ብር

source: Annual - 5000 ETB
ti: ኣብ ኣመት - 5000 ብር

source: Category:
ti: መደብ:

source: Duration:
ti: ግዜ:

source: No video available.
ti: ቪዲዮ ኣይኮነን።

source: Failed to initialize Chapa payment. Response: %(response)s
ti: ምንጪ ክፍሊት Chapa ኣይተጀመረን። ምላሽ: %(response)s

source: No transaction reference provided.
ti: መልእኽቲ መስርሕ ኣይተሰጠን።

source: CineHub Subscription Name: %(name)s Email: %(email)s Type: %(type)s
ti: ኣባልነት CineHub ስም: %(name)s ኢሜይል: %(email)s ኣይነት: %(type)s

source: 🎫 CineHub Subscription Confirmed
ti: 🎫 ኣባልነት CineHub ተረኽበ

source: Hi %(name)s, Your %(plan)s subscription is now active! Thanks for choosing CineHub.
ti: ሰላም %(name)s, ኣባልነት %(plan)s ኣሁን ንሕዝብ ኣሎ! ኣመሰግናለይ ንምርጫዎ CineHub.

source: Payment not successful.
ti: ክፍሊት ኣይተሳነን።

source: Streaming Subscription
ti: ኣባልነት ንመርበብ

source: %(plan)s subscription for streaming access
ti: ኣባልነት %(plan)s ንመርበብ

source: Failed to initialize payment: %(response)s
ti: ምንጪ ክፍሊት ኣይተጀመረን: %(response)s

source: Invalid credentials.
ti: መኣዝያ ዘይተፈትነ

source: Invalid JSON
ti: JSON ዘይተፈትነ

source: Completion Rate (%)
ti: ደመወዝ ኣስከተለን (%)

source: Cinema Streaming
ti: ሲነማ ንመርበብ

source: Cinema Streaming. All rights reserved.
ti: ሲነማ ንመርበብ። ኩሎም መብት የተጠበቐ

source: Messages
ti: መልእኽቲ

source: Site Maps
ti: ካርታ ጣብያ

source: Static Files
ti: ዝቆርጠ ፋይልታት

source: Syndication
ti: ማዕከን ኣርኣያት

source: That page number is not an integer
ti: ቁጽሪ ገፅ ኣይኮነን ንቁጽሪ ሙሉ

source: That page number is less than 1
ti: ቁጽሪ ገፅ ከ1 ትንሽ እዩ

source: That page contains no results
ti: በዚ ገፅ ውጽኢት የተኽኣልን

source: Enter a valid value.
ti: ኣንቀጽ ዝተፈትነ ዋጋ ያስገቡ

source: Enter a valid domain name.
ti: ምሉእ ዝተፈትነ ስም ዕድል ያስገቡ

source: Enter a valid URL.
ti: ምሉእ ዝተፈትነ URL ያስገቡ

source: Enter a valid integer.
ti: ኣንቀጽ ዝተፈትነ ቁጽሪ ያስገቡ

source: Enter a valid email address.
ti: ምሉእ ዝተፈትነ ኢሜይል ኣድራሻ ያስገቡ

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ti: ምሉእ ዝተፈትነ “slug” ከፊል ፊደላት, ቁጽሪ, ነጠላ ማዕከን ወይ ሐይፐን ይኾን ያስገቡ

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ti: ምሉእ ዝተፈትነ “slug” ከፊል ፊደላ

source: Enter a valid %(protocol)s address.
ti: ምሉእ ዝተፈትነ %(protocol)s ኣድራሻ ያስገቡ

source: IPv4 or IPv6
ti: IPv4 ወይ IPv6

source: Enter only digits separated by commas.
ti: ኣንቀጽ ቁጽሪ ብብዛዕባ ብኩሉ ያስገቡ

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ti: ዝተሰገረ ዋጋ %(limit_value)s እዩ እንተዘይኮነ %(show_value)s።

source: Ensure this value is less than or equal to %(limit_value)s.
ti: ዝተሰገረ ዋጋ ከ%(limit_value)s ትንሽ ወይ ኣብሉ እዩ እንተዘይኮነ።

source: Ensure this value is greater than or equal to %(limit_value)s.
ti: ዝተሰገረ ዋጋ ከ%(limit_value)s ዝበለ ወይ ኣብሉ እዩ እንተዘይኮነ።

source: Ensure this value is a multiple of step size %(limit_value)s.
ti: ዝተሰገረ ዋጋ ኣብ ኣሰሳ ከ%(limit_value)s እዩ እንተዘይኮነ።

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ti: ዝተሰገረ ዋጋ ኣብ ኣሰሳ ከ%(limit_value)s እዩ ኣብ %(offset)s ክትጀምር። ምሳሌ %(offset)s, %(valid_value1)s, %(valid_value2)s, ከዚ መሰል።

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
ti: ዝተሰገረ ዋጋ ቢዝነት %(limit_value)d ፊደላት ኣለዎ፣ %(show_value)d ኣሎዎ።

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
ti: ዝተሰገረ ዋጋ ኣብሉ %(limit_value)d ፊደላት ክኸውን ይኽእል፣ %(show_value)d ኣሎዎ።

source: Enter a number.
ti: ቁጽሪ ያስገቡ

source: Ensure that there are no more than %(max)s digit in total.
ti: ከ%(max)s ቁጽሪ በላዕ ኣይኮንን።

source: Ensure that there are no more than %(max)s decimal place.
ti: ከ%(max)s ቁጽሪ ድምር በላዕ ኣይኮንን።

source: Ensure that there are no more than %(max)s digit before the decimal point.
ti: ከ%(max)s ቁጽሪ በፊት ኣቅጽሪ ኣይኮንን።

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
ti: ዝተፈትነ ፋይል ስርሐት “%(extension)s” ኣይፈቐደን። ፈቐደ ዝተፈትነ ፋይል ስርሐትታት: %(allowed_extensions)s.

source: Null characters are not allowed.
ti: ባዶ ፊደላት ኣይፈቐደን።

source: and
ti: እንተኾይኑ

source: %(model_name)s with this %(field_labels)s already exists.
ti: ኣብ %(model_name)s ከዚ %(field_labels)s ኣሎዎ እዩ።

source: Constraint “%(name)s” is violated.
ti: መደብ ስም “%(name)s” ተፈትነ።

source: Value %(value)r is not a valid choice.
ti: ዋጋ %(value)r ዝተፈትነ ምርጫ ኣይኮንን።

source: This field cannot be null.
ti: ዝተመደበ ሜዳ ባዶ ኣይክእልን።

source: This field cannot be blank.
ti: ዝተመደበ ሜዳ ባዶ ኣይትሙሉን።

source: %(model_name)s with this %(field_label)s already exists.
ti: ኣብ %(model_name)s ከዚ %(field_label)s ኣሎዎ እዩ።

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
ti: %(field_label)s ብዝተፈላለየ %(date_field_label)s %(lookup_type)s ኣሎና ክኾነ ይኽእል።

source: Field of type: %(field_type)s
ti: ዝኣምረ ዓይነት ሜዳ: %(field_type)s

source: “%(value)s” value must be either True or False.
ti: ዋጋ “%(value)s” እቲ እዩ ወይ ዘይእዩ ክኾን ይኽእል።

source: “%(value)s” value must be either True, False, or None.
ti: ዋጋ “%(value)s” እቲ እዩ, ዘይእዩ ወይ ምንታይን (None) ክኾን ይኽእል።

source: Boolean (Either True or False)
ti: Boolean (እዩ ወይ ዘይእዩ)

source: String (up to %(max_length)s)
ti: ጽሑፍ (ክሳብ %(max_length)s ፊደላት)

source: String (unlimited)
ti: ጽሑፍ (ዘይብዙሕ ፊደላት)

source: Comma-separated integers
ti: ቁጽሪ በብዛዕባ ተክፎ

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
ti: ዋጋ “%(value)s” ዝተፈትነ ዕድል ቀን ኣይኮነን። ኣብ YYYY-MM-DD ፎርማት ይኾን ኣለዎ።

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
ti: ዋጋ “%(value)s” ፎርማት እዩ (YYYY-MM-DD) እንተዘይኮነ ቀን ዘይተፈትነ እዩ።

source: Date (without time)
ti: ቀን (ብዘይ ግዜ)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
ti: ዋጋ “%(value)s” ፎርማት ዘይተፈትነ እዩ። ኣብ YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] ፎርማት ክኾን ይኽእል።

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
ti: ዋስታር %(value)s ብትኽክል ፎርማት (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) እዩ፣ ግን ዘይትኽክል ዕለት/ግዜ እዩ።

source: Date (with time)
ti: ዕለት (ምስ ግዜ)

source: “%(value)s” value must be a decimal number.
ti: ዋስታር %(value)s ዲሲማል ቍጽሪ ክኸውን ኣለዎ።

source: Decimal number
ti: ዲሲማል ቍጽሪ

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
ti: ዋስታር %(value)s ትክክል ዘይኮነ ፎርማት ኣለዎ። ብ [DD] [[HH:]MM:]ss[.uuuuuu] ፎርማት ክኸውን ኣለዎ።

source: Duration
ti: ዝዕውት ግዜ

source: Email address
ti: ኢሜይል ኣድራሻ

source: File path
ti: ፋይል መንገዲ

source: “%(value)s” value must be a float.
ti: ዋስታር %(value)s ፍሎት ክኸውን ኣለዎ።

source: Floating point number
ti: ፍሎቲንግ ቁጽሪ

source: “%(value)s” value must be an integer.
ti: ዋስታር %(value)s ኢንቲጀር ክኸውን ኣለዎ።

source: Integer
ti: ኢንቲጀር

source: Big (8 byte) integer
ti: ዓቢ (8 ባይት) ኢንቲጀር

source: Small integer
ti: ንኡስ ኢንቲጀር

source: IPv4 address
ti: IPv4 ኣድራሻ

source: IP address
ti: IP ኣድራሻ

source: “%(value)s” value must be either None, True or False.
ti: ዋስታር %(value)s ኣንታ None፣ True ወይ False ክኸውን ኣለዎ።

source: Boolean (Either True, False or None)
ti: ቡሊያን (True፣ False ወይ None)

source: Positive big integer
ti: ዓቢ ኣፍሉጥ ኢንቲጀር

source: Positive integer
ti: ኣፍሉጥ ኢንቲጀር

source: Positive small integer
ti: ንኡስ ኣፍሉጥ ኢንቲጀር

source: Slug (up to %(max_length)s)
ti: ስሉግ (ክሳብ %(max_length)s)

source: Text
ti: ጽሑፍ

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
ti: ዋስታር %(value)s ትክክል ዘይኮነ ፎርማት ኣለዎ። ብ HH:MM[:ss[.uuuuuu]] ፎርማት ክኸውን ኣለዎ።

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
ti: ዋስታር %(value)s ብትክክል ፎርማት (HH:MM[:ss[.uuuuuu]]) እዩ፣ ግን ዘይትኽክል ግዜ እዩ።

source: Time
ti: ግዜ

source: Raw binary data
ti: ነባር ባይነሪ ውሂብ

source: “%(value)s” is not a valid UUID.
ti: “%(value)s” ትክክል UUID ኣይኮነን።

source: Universally unique identifier
ti: ዓለማዊ ብዙሕነት ምልክታ

source: File
ti: ፋይል

source: Image
ti: ምስሊ

source: A JSON object
ti: JSON ነገር

source: Value must be valid JSON.
ti: ዋስታር ትክክል JSON ክኸውን ኣለዎ።

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
ti: %(model)s ናይ %(field)s %(value)r ምስ እዚ ትክክል ኣልቦ ምርጫ እዩ።

source: Foreign Key (type determined by related field)
ti: ወጻኢ ቁልፊ (ናይ ዝተዛመደ ሜዳ ዓይነት ዝመርጽ)

source: One-to-one relationship
ti: ሓደ-ን-ሓደ ግንኙነት

source: %(from)s-%(to)s relationship
ti: ግንኙነት %(from)s-%(to)s

source: %(from)s-%(to)s relationships
ti: ግንኙነታት %(from)s-%(to)s

source: Many-to-many relationship
ti: ብዙሕ-ን-ብዙሕ ግንኙነት

source: This field is required.
ti: እዚ መስክ ኣጠቓቕማ እዩ።

source: Enter a whole number.
ti: ኣንደኛ ቁጽሪ ኣእትዉ።

source: Enter a valid date.
ti: ትኽክል ዕለት ኣእትዉ።

source: Enter a valid time.
ti: ትኽክል ግዜ ኣእትዉ።

source: Enter a valid date/time.
ti: ትኽክል ዕለት/ግዜ ኣእትዉ።

source: Enter a valid duration.
ti: ትኽክል ግዜ ክፋል ኣእትዉ።

source: The number of days must be between {min_days} and {max_days}.
ti: ብዙሕ መዓልቲ ከም {min_days} ን {max_days} ክልቲ ዝኾነ ክምሃር ኣለዎ።

source: No file was submitted. Check the encoding type on the form.
ti: ፋይል ኣይተሰዲደን። ቅጥዒ ናይ encoding ኣብ ፎርም ኣረጋግጹ።

source: No file was submitted.
ti: ፋይል ኣይተሰዲደን።

source: The submitted file is empty.
ti: ተሰዲዱ ፋይል ባዶ እዩ።

source: Ensure this filename has at most %(max)d character (it has %(length)d).
ti: ስም ፋይልኩም ክሳብ %(max)d ቁምፊ ክኸውን ኣለዎ (ኣሎ %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
ti: በጃኹም ፋይል ኣስረኽቡ ወይ ናይ clear ክብር ምልክት ኣረጋግጹ፣ ክልቲኦም ኣይኮኑን።

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ti: ትኽክል ምስሊ ኣስርአን። ፋይል ኣስርኡዎ ምስሊ ኣይኮነን ወይቲ ተበላሽቲ ምስሊ እዩ።

source: Select a valid choice. %(value)s is not one of the available choices.
ti: ትኽክል ምርጫ ምረጹ። %(value)s ካብ ዝተሓርዩ ምርጫታት ኣይኮነን።

source: Enter a list of values.
ti: ዝርዝር ናይ ዋጋታት ኣእትዉ።

source: Enter a complete value.
ti: ሙሉእ ዋጋ ኣእትዉ።

source: Enter a valid UUID.
ti: ትኽክል UUID ኣእትዉ።

source: Enter a valid JSON.
ti: ትኽክል JSON ኣእትዉ።

source: (Hidden field %(name)s) %(error)s
ti: (ተደብቂ መስክ %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
ti: ውሂብ ናይ ManagementForm ዝጎደለ ወይ ተበላሽቱ እዩ። ዝጎደሉ መስኮታት: %(field_names)s። እቲ ጉዳይ ንኽትከውን እንተቀይረ ናይ bug report ምስዳድ ክንደይ ኣለኩም።

source: Please submit at most %(num)d form.
ti: በጃኹም ክሳብ %(num)d ፎርም ኣስረኽቡ።

source: Please submit at least %(num)d form.
ti: በጃኹም ቢያንስ %(num)d ፎርም ኣስረኽቡ።

source: Order
ti: ትዕዛዝ

source: Delete
ti: ሰርዝ

source: Please correct the duplicate data for %(field)s.
ti: በጃኹም ተደጋጊሙ ውሂቡ %(field)s ኣስተካክሉ።

source: Please correct the duplicate data for %(field)s, which must be unique.
ti: በጃኹም ተደጋጊሙ ውሂቡ %(field)s ኣስተካክሉ፣ እቲ ንሓደ ክኸውን ኣለዎ።

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
ti: በጃኹም ተደጋጊሙ ውሂቡ %(field_name)s ኣስተካክሉ፣ እቲ ን %(lookup)s ኣብ %(date_field)s ንሓደ ክኸውን ኣለዎ።

source: Please correct the duplicate values below.
ti: በጃኹም ተደጋጊሙ ዋጋታት ታሕቲ ኣስተካክሉ።

source: The inline value did not match the parent instance.
ti: ናይ inline ዋጋ ናይ ኣቦ ናይ ተግባር ኣይተዛመዐን።

source: Select a valid choice. That choice is not one of the available choices.
ti: ትኽክል ምርጫ ምረጹ። እቲ ምርጫ ካብ ዝተሓርዩ ምርጫታት ኣይኮነን።

source: “%(pk)s” is not a valid value.
ti: “%(pk)s” ትኽክል ዋጋ ኣይኮነን።

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
ti: %(datetime)s ኣብ ግዜ ኣብልዎ %(current_timezone)s ክትተርጓም ኣልቦን፤ ዝርግጽ ኣይኮነን ወይ ምንባር ኣይብሉን።

source: Clear
ti: ኣፅዳ

source: Currently
ti: ሕጂ

source: Change
ti: ቀይር

source: Yes
ti: እወ

source: No
ti: ኣይኮነን

source: yes,no,maybe
ti: እወ,ኣይኮነን,ምናልባት

source: %(size)d byte
ti: %(size)d ባይት

source: %s KB
ti: %s ኪቢ

source: %s MB
ti: %s ሜቢ

source: %s GB
ti: %s ጊቢ

source: %s TB
ti: %s ተቢ

source: %s PB
ti: %s ፒቢ

source: p.m.
ti: ምሽት

source: a.m.
ti: ንጉሆ

source: PM
ti: ምሽት

source: AM
ti: ንጉሆ

source: midnight
ti: ሰኒ

source: noon
ti: ቀትሪ

source: Monday
ti: ሰኑይ

source: Tuesday
ti: ሰሉስ

source: Wednesday
ti: ረቡዕ

source: Thursday
ti: ሓሙስ

source: Friday
ti: ዓርቢ

source: Saturday
ti: ቀዳም

source: Sunday
ti: ሰንበት

source: Mon
ti: ሰኑ

source: Tue
ti: ሰሉ

source: Wed
ti: ረቡ

source: Thu
ti: ሓሙ

source: Fri
ti: ዓርቢ

source: Sat
ti: ቀዳ

source: Sun
ti: ሰንበ

source: January
ti: ጥሪ

source: February
ti: ለካቲት

source: March
ti: መጋቢት

source: April
ti: ሚያዝያ

source: May
ti: ግንቦት

source: June
ti: ሰነ

source: July
ti: ሓምለ

source: August
ti: ነሓሰ

source: September
ti: መስከረም

source: October
ti: ጥቅምቲ

source: November
ti: ሕዳር

source: December
ti: ታሕሳስ

source: jan
ti: ጥሪ

source: feb
ti: ለካቲት

source: mar
ti: መጋቢት

source: apr
ti: ሚያዝያ

source: may
ti: ግንቦት

source: jun
ti: ሰነ

source: jul
ti: ሓምለ

source: aug
ti: ነሓሰ

source: sep
ti: መስከረም

source: oct
ti: ጥቅምቲ

source: nov
ti: ሕዳር

source: dec
ti: ታሕሳስ

# abbrev. month
source: Jan.
ti: ጥሪ.

# abbrev. month
source: Feb.
ti: ለካ.

# abbrev. month
source: March
ti: መጋ.

# abbrev. month
source: April
ti: ሚያ.

# abbrev. month
source: May
ti: ግን.

# abbrev. month
source: June
ti: ሰነ.

# abbrev. month
source: July
ti: ሓም.

# abbrev. month
source: Aug.
ti: ነሓ.

# abbrev. month
source: Sept.
ti: መስ.

# abbrev. month
source: Oct.
ti: ጥቅ.

# abbrev. month
source: Nov.
ti: ሕዳ.

# abbrev. month
source: Dec.
ti: ታሕ.

# alt. month
source: January
ti: ጥሪ

# alt. month
source: February
ti: ለካቲት

# alt. month
source: March
ti: መጋቢት

# alt. month
source: April
ti: ሚያዝያ

# alt. month
source: May
ti: ግንቦት

# alt. month
source: June
ti: ሰነ

# alt. month
source: July
ti: ሓምለ

# alt. month
source: August
ti: ነሓሰ

# alt. month
source: September
ti: መስከረም

# alt. month
source: October
ti: ጥቅምቲ

# alt. month
source: November
ti: ሕዳር

# alt. month
source: December
ti: ታሕሳስ

source: This is not a valid IPv6 address.
ti: እዚ ትኽክለኛ ናይ IPv6 ኣድረስ ኣይኮነን።

source: or
ti: ወይ

source: %(num)d year
ti: %(num)d ዓመት

source: %(num)d month
ti: %(num)d ወርሒ

source: %(num)d week
ti: %(num)d ሳምንት

source: %(num)d day
ti: %(num)d መዓልቲ

source: %(num)d hour
ti: %(num)d ሰዓት

source: %(num)d minute
ti: %(num)d ደቓይቕ

source: Forbidden
ti: ዝተኣግደ

source: CSRF verification failed. Request aborted.
ti: ናይ CSRF ምርመራ ኣክልጎ። መሕደራ ተትሒሉ።

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ti: እዚ መልእኽቲ ንምርኣይ እንተኽእልኩም ምኽንያቱ እዚ HTTPS ሳይት ናይ “Referer header” ናብ ኣሳሳሲ ናይ ባህሪ እንተምትሓተት ይደሊ፣ ግን ዝተላኣኽ የለን። እዚ header ብጥንታነ ምኽንያታት ይደሊ፣ ንምዝጋመ እቲ browser እንተዘይተሰርቐ ብተሓሳስባት ካልኦት ወጻኢ ይኸውን እዩ።

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
ti: እቲ browser እንተኣዘጋጀኩም ናይ “Referer” header ንምብራርክ እንተኾነ፣ በጃኹም እንደገና ኣብዚ ሳይት ኣብ least እንተኾነ፣ ወይ ን HTTPS ግንኙነታት ወይ “same-origin” ሓሳባት ንምብቃል ኣድርጉ።

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
ti: እንተተጠቐምኩም <meta name="referrer" content="no-referrer"> tag ወይ “Referrer-Policy: no-referrer” header እንተኣካተትኩም፣ በጃኹም ኣውጹዎም። ናይ CSRF መኽርነት ናይ “Referer” header ንምርምር ጽንዓተኛ ይደሊ። እቲ ግል ምክንያት እንተረዳኣኹም፣ ናይ ኣማራጺ ኣብ ሳይታት ካልኦት እንተረኣዩ <a rel="noreferrer" …> ተጠቐም።
